app/controllers/images_controller.rb

  def create
    image = Image.new(params_list)
    image.save
---
INSERT INTO "images" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-08-09 08:26:31.575459"], ["updated_at", "2014-08-09 08:26:31.575459"]]